{"keras_version": "2.0.8", "config": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "embeddings_regularizer": null, "dtype": "float32", "batch_input_shape": [64, 512], "embeddings_constraint": null, "input_dim": 100, "output_dim": 32, "activity_regularizer": null, "mask_zero": false, "trainable": true, "name": "embedding_1", "input_length": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.0}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "stateful": true, "return_sequences": true, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "recurrent_constraint": null, "return_state": false, "trainable": true, "bias_constraint": null, "units": 256, "name": "lstm_1", "go_backwards": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "unroll": false, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.0}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "stateful": true, "return_sequences": true, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "recurrent_constraint": null, "return_state": false, "trainable": true, "bias_constraint": null, "units": 256, "name": "lstm_2", "go_backwards": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "unroll": false, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.0}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "stateful": true, "return_sequences": true, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "recurrent_constraint": null, "return_state": false, "trainable": true, "bias_constraint": null, "units": 256, "name": "lstm_3", "go_backwards": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 0, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "unroll": false, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.0}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_1", "layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "units": 100, "name": "dense_1", "activity_regularizer": null}}}}], "backend": "tensorflow", "class_name": "Sequential"}