{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Embedding", "config": {"input_length": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "name": "embedding_1", "mask_zero": false, "embeddings_regularizer": null, "input_dim": 100, "activity_regularizer": null, "dtype": "float32", "embeddings_constraint": null, "trainable": true, "batch_input_shape": [1, 1], "output_dim": 38}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.0}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "units": 404, "name": "lstm_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "dropout": 0.0, "implementation": 0, "stateful": true, "return_sequences": true, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "activation": "tanh", "kernel_constraint": null, "recurrent_constraint": null, "unit_forget_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "return_state": false, "unroll": false, "recurrent_dropout": 0.0, "bias_constraint": null, "trainable": true, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.0}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "units": 404, "name": "lstm_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "dropout": 0.0, "implementation": 0, "stateful": true, "return_sequences": true, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "activation": "tanh", "kernel_constraint": null, "recurrent_constraint": null, "unit_forget_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "return_state": false, "unroll": false, "recurrent_dropout": 0.0, "bias_constraint": null, "trainable": true, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.0}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "units": 404, "name": "lstm_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "dropout": 0.0, "implementation": 0, "stateful": true, "return_sequences": true, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "activation": "tanh", "kernel_constraint": null, "recurrent_constraint": null, "unit_forget_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "return_state": false, "unroll": false, "recurrent_dropout": 0.0, "bias_constraint": null, "trainable": true, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.0}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_1", "layer": {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "units": 100, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax"}}}}]}
