{"config": [{"config": {"units": 512, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 0, "activation": "tanh", "go_backwards": false, "dropout": 0.0, "recurrent_dropout": 0.0, "batch_input_shape": [null, 40, 34], "return_sequences": true, "bias_regularizer": null, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_1", "kernel_constraint": null, "unroll": false, "return_state": false, "use_bias": true, "trainable": true, "dtype": "float32", "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"units": 512, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 0, "activation": "tanh", "go_backwards": false, "dropout": 0.0, "recurrent_dropout": 0.0, "return_sequences": true, "bias_regularizer": null, "activity_regularizer": null, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "kernel_constraint": null, "unroll": false, "return_state": false, "use_bias": true, "trainable": true, "name": "lstm_2", "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"units": 512, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 0, "activation": "tanh", "go_backwards": false, "dropout": 0.0, "recurrent_dropout": 0.0, "return_sequences": false, "bias_regularizer": null, "activity_regularizer": null, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "kernel_constraint": null, "unroll": false, "return_state": false, "use_bias": true, "trainable": true, "name": "lstm_3", "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"units": 34, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_constraint": null, "activation": "linear", "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8"}