{"keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"bias_regularizer": null, "recurrent_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "go_backwards": false, "kernel_regularizer": null, "return_sequences": true, "activity_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "unroll": false, "dropout": 0.0, "return_state": false, "implementation": 0, "recurrent_dropout": 0.0, "stateful": false, "activation": "tanh", "batch_input_shape": [null, 60, 34], "recurrent_regularizer": null, "name": "lstm_1", "bias_constraint": null, "dtype": "float32", "use_bias": true}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "recurrent_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "go_backwards": false, "kernel_regularizer": null, "return_sequences": true, "activity_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "unroll": false, "dropout": 0.0, "return_state": false, "implementation": 0, "recurrent_dropout": 0.0, "stateful": false, "activation": "tanh", "recurrent_regularizer": null, "name": "lstm_2", "bias_constraint": null, "use_bias": true}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "recurrent_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "go_backwards": false, "kernel_regularizer": null, "return_sequences": false, "activity_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "unroll": false, "dropout": 0.0, "return_state": false, "implementation": 0, "recurrent_dropout": 0.0, "stateful": false, "activation": "tanh", "recurrent_regularizer": null, "name": "lstm_3", "bias_constraint": null, "use_bias": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 34, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "softmax", "trainable": true}}]}