{"keras_version": "2.0.8", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_regularizer": null, "batch_input_shape": [null, 40, 34], "kernel_constraint": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "unit_forget_bias": true, "trainable": true, "go_backwards": false, "units": 128, "unroll": false, "return_sequences": false, "return_state": false, "bias_regularizer": null, "bias_constraint": null, "name": "lstm_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dtype": "float32", "dropout": 0.0, "recurrent_constraint": null, "recurrent_dropout": 0.0, "implementation": 0, "activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "bias_constraint": null, "name": "dense_1", "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "activation": "linear", "units": 34}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}], "backend": "tensorflow"}