{"config": [{"config": {"recurrent_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "go_backwards": false, "activation": "tanh", "unroll": false, "stateful": false, "kernel_constraint": null, "return_state": false, "batch_input_shape": [null, 40, 34], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "return_sequences": true, "recurrent_regularizer": null, "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "implementation": 0, "recurrent_dropout": 0.0, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "trainable": true, "use_bias": true, "bias_regularizer": null, "dtype": "float32", "name": "lstm_1", "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"recurrent_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "go_backwards": false, "activation": "tanh", "unroll": false, "stateful": false, "kernel_constraint": null, "return_state": false, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "return_sequences": false, "recurrent_regularizer": null, "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "implementation": 0, "recurrent_dropout": 0.0, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "trainable": true, "use_bias": true, "bias_regularizer": null, "name": "lstm_2", "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "linear", "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "units": 34}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow"}