{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "activity_regularizer": null, "unit_forget_bias": true, "kernel_regularizer": null, "implementation": 1, "batch_input_shape": [null, 1, 36], "recurrent_regularizer": null, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "return_sequences": true, "recurrent_constraint": null, "dtype": "float32", "dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "trainable": true, "bias_regularizer": null, "name": "lstm_1", "return_state": false, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "use_bias": true, "units": 256}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.05, "trainable": true}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "activity_regularizer": null, "unit_forget_bias": true, "kernel_regularizer": null, "implementation": 1, "batch_input_shape": [null, 1, 36], "recurrent_regularizer": null, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "go_backwards": false, "return_sequences": false, "recurrent_constraint": null, "dtype": "float32", "dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "trainable": true, "bias_regularizer": null, "name": "lstm_2", "return_state": false, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "use_bias": true, "units": 256}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_regularizer": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "use_bias": true, "kernel_regularizer": null, "units": 36}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "backend": "tensorflow", "keras_version": "2.1.2"}
