{"config": [{"config": {"kernel_constraint": null, "unroll": false, "return_sequences": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "recurrent_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dropout": 0.0, "recurrent_regularizer": null, "activity_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "recurrent_dropout": 0.0, "return_state": false, "name": "lstm_1", "unit_forget_bias": true, "kernel_regularizer": null, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dtype": "float32", "implementation": 0, "batch_input_shape": [null, 50, 34], "go_backwards": false, "units": 256, "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "unroll": false, "return_sequences": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "recurrent_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dropout": 0.0, "recurrent_regularizer": null, "activity_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "recurrent_dropout": 0.0, "return_state": false, "name": "lstm_2", "unit_forget_bias": true, "kernel_regularizer": null, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dtype": "float32", "implementation": 0, "batch_input_shape": [null, 50, 34], "go_backwards": false, "units": 256, "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "kernel_constraint": null, "activation": "linear", "use_bias": true, "name": "dense_1", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 34, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow"}
