{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Embedding", "config": {"embeddings_constraint": null, "name": "embedding_1", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "trainable": true, "dtype": "float32", "input_dim": 100, "batch_input_shape": [1, 1], "embeddings_regularizer": null, "mask_zero": false, "activity_regularizer": null, "input_length": null, "output_dim": 32}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.0}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "name": "lstm_1", "activation": "tanh", "stateful": true, "recurrent_constraint": null, "kernel_regularizer": null, "dropout": 0.0, "implementation": 0, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "recurrent_dropout": 0.0, "return_state": false, "trainable": true, "units": 256, "return_sequences": true, "unit_forget_bias": true, "unroll": false, "kernel_constraint": null, "use_bias": true, "go_backwards": false, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.0}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "name": "lstm_2", "activation": "tanh", "stateful": true, "recurrent_constraint": null, "kernel_regularizer": null, "dropout": 0.0, "implementation": 0, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "recurrent_dropout": 0.0, "return_state": false, "trainable": true, "units": 256, "return_sequences": true, "unit_forget_bias": true, "unroll": false, "kernel_constraint": null, "use_bias": true, "go_backwards": false, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.0}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "name": "lstm_3", "activation": "tanh", "stateful": true, "recurrent_constraint": null, "kernel_regularizer": null, "dropout": 0.0, "implementation": 0, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "recurrent_dropout": 0.0, "return_state": false, "trainable": true, "units": 256, "return_sequences": true, "unit_forget_bias": true, "unroll": false, "kernel_constraint": null, "use_bias": true, "go_backwards": false, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.0}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_1", "activation": "softmax", "trainable": true, "units": 100, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_1"}}]}