{"config": [{"config": {"batch_input_shape": [1, 1], "name": "embedding_1", "input_length": null, "activity_regularizer": null, "output_dim": 32, "embeddings_constraint": null, "input_dim": 100, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "dtype": "float32", "embeddings_regularizer": null, "trainable": true, "mask_zero": false}, "class_name": "Embedding"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.0}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": true, "name": "lstm_1", "dropout": 0.0, "return_sequences": true, "recurrent_regularizer": null, "unit_forget_bias": true, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "bias_regularizer": null, "recurrent_dropout": 0.0, "implementation": 0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "activity_regularizer": null, "trainable": true, "go_backwards": false, "unroll": false, "units": 256}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.0}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": true, "name": "lstm_2", "dropout": 0.0, "return_sequences": true, "recurrent_regularizer": null, "unit_forget_bias": true, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "bias_regularizer": null, "recurrent_dropout": 0.0, "implementation": 0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "activity_regularizer": null, "trainable": true, "go_backwards": false, "unroll": false, "units": 256}, "class_name": "LSTM"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.0}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": true, "name": "lstm_3", "dropout": 0.0, "return_sequences": true, "recurrent_regularizer": null, "unit_forget_bias": true, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "bias_regularizer": null, "recurrent_dropout": 0.0, "implementation": 0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "activity_regularizer": null, "trainable": true, "go_backwards": false, "unroll": false, "units": 256}, "class_name": "LSTM"}, {"config": {"name": "dropout_4", "trainable": true, "rate": 0.0}, "class_name": "Dropout"}, {"config": {"name": "time_distributed_1", "trainable": true, "layer": {"config": {"kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 100}, "class_name": "Dense"}}, "class_name": "TimeDistributed"}], "keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential"}